# Summer of Code - Artificial Intelligence
## Week 04: Exploratory Data Analysis
### Day 04: Advanced Pandas

In this notebook, we will cover advanced topics such as reshaping data, combining datasets, and using the groupby function for aggregation.

In [1]:
import pandas as pd

pd.__version__

'2.2.3'

In [ ]:
names = pd.Series(["Wajahat", "Ahmad", "Ali"])
names

0    Wajahat
1      Ahmad
2        Ali
dtype: object

In [4]:
names.index

RangeIndex(start=0, stop=3, step=1)

In [6]:
names = pd.Series(["Wajahat", "Ahmad", "Ali"], index=["A", "B", "C"])
names

A    Wajahat
B      Ahmad
C        Ali
dtype: object

In [11]:
names["A"]

'Wajahat'

In [ ]:
# students
students = {
    "Names": ["Wajahat", "Ahmad", "Ali"],
    "Age": [23, 20, 25],
    "gpa": [3.4, 3.0, 3.7],
}

students

{'Names': ['Wajahat', 'Ahmad', 'Ali'],
 'Age': [23, 20, 25],
 'gpa': [3.4, 3.0, 3.7]}

In [13]:
students["Names"]

['Wajahat', 'Ahmad', 'Ali']

In [14]:
students_df = pd.DataFrame(students)
students_df

     Names  Age  gpa
0  Wajahat   23  3.4
1    Ahmad   20  3.0
2      Ali   25  3.7

In [15]:
students_df.index

RangeIndex(start=0, stop=3, step=1)

In [16]:
students_df.columns

Index(['Names', 'Age', 'gpa'], dtype='object')

In [17]:
students_df.values

array([['Wajahat', 23, 3.4],
       ['Ahmad', 20, 3.0],
       ['Ali', 25, 3.7]], dtype=object)

In [19]:
students_df["Names"]

0    Wajahat
1      Ahmad
2        Ali
Name: Names, dtype: object

In [20]:
students_df[["Names", "Age"]]

     Names  Age
0  Wajahat   23
1    Ahmad   20
2      Ali   25

In [23]:
students_df.iloc[0]

Names    Wajahat
Age           23
gpa          3.4
Name: 0, dtype: object

In [24]:
students_df.iloc[:2]

     Names  Age  gpa
0  Wajahat   23  3.4
1    Ahmad   20  3.0

In [27]:
students_df.iloc[:2, :2]

     Names  Age
0  Wajahat   23
1    Ahmad   20

In [28]:
students_df.loc[0, "Age"]

np.int64(23)

In [31]:
!unzip ../../datasets/california_house_prices.zip -d ../../datasets/california_house_prices

Archive:  ../../datasets/california_house_prices.zip
  inflating: ../../datasets/california_house_prices/housing.csv

In [ ]:
data = pd.read_csv("../../datasets/california_house_prices/housing.csv")
type(data)

pandas.core.frame.DataFrame

In [33]:
data

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [36]:
data.head(n=5)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [37]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20640 entries, 0 to 20639
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           20640 non-null  float64
 1   latitude            20640 non-null  float64
 2   housing_median_age  20640 non-null  float64
 3   total_rooms         20640 non-null  float64
 4   total_bedrooms      20433 non-null  float64
 5   population          20640 non-null  float64
 6   households          20640 non-null  float64
 7   median_income       20640 non-null  float64
 8   median_house_value  20640 non-null  float64
 9   ocean_proximity     20640 non-null  object
dtypes: float64(9), object(1)
memory usage: 1.6+ MB

In [38]:
data.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,20640.000000,20640.000000,20640.000000,20640.000000,20433.000000,20640.000000,20640.000000,20640.000000,20640.000000
mean,-119.569704,35.631861,28.639486,2635.763081,537.870553,1425.476744,499.539680,3.870671,206855.816909
std,2.003532,2.135952,12.585558,2181.615252,421.385070,1132.462122,382.329753,1.899822,115395.615874
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.800000,33.930000,18.000000,1447.750000,296.000000,787.000000,280.000000,2.563400,119600.000000
50%,-118.490000,34.260000,29.000000,2127.000000,435.000000,1166.000000,409.000000,3.534800,179700.000000
75%,-118.010000,37.710000,37.000000,3148.000000,647.000000,1725.000000,605.000000,4.743250,264725.000000
max,-114.310000,41.950000,52.000000,39320.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

In [52]:
data.loc[:5, "population":"median_income"]

   population  households  median_income
0       322.0       126.0         8.3252
1      2401.0      1138.0         8.3014
2       496.0       177.0         7.2574
3       558.0       219.0         5.6431
4       565.0       259.0         3.8462
5       413.0       193.0         4.0368

## Adding new columns

- Vectorized arithmetic and string ops
- `assign` for chaining
- Conditional logic with `np.where` and `np.select`

In [ ]:
data["average_number_of_people"] = data["population"] / data["households"]

In [65]:
data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity,average_number_of_people
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY,2.555556
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY,2.109842
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY,2.802260
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY,2.547945
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY,2.181467

In [72]:
data = data.assign(
    median_income_k=data["median_income"] * 1000,
    ocean_proximity=lambda d: d["ocean_proximity"].str.lower(),
    average_number_of_people=data["average_number_of_people"].round(0),
)

In [73]:
data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity,average_number_of_people,median_income_k
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,near bay,3.0,8325.2
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,near bay,2.0,8301.4
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,near bay,3.0,7257.4
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,near bay,3.0,5643.1
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,near bay,2.0,3846.2

## Reshaping DataFrames

- `melt` (wide -> long)
- `pivot` (long -> wide, single value per index/column)
- `pivot_table` (aggregation with duplicates)

In [2]:
import pandas as pd

## Combining DataFrames

- `concat` for stacking vertically or horizontally
- `merge` for SQL-style joins (`inner`, `left`, `right`, `outer`)
- Keys and validation (`validate='one_to_one'`, etc.)

In [ ]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"], "Age": [20, 23]})
df1

    Name  Age
0  Alice   20
1    Bob   23

In [ ]:
df2 = pd.DataFrame({"Name": ["Ali"], "Age": [20]})
df2

  Name  Age
0  Ali   20

In [ ]:
df3 = pd.DataFrame({"Name": ["Waqas"], "Age": [30]})
df3

    Name  Age
0  Waqas   30

In [7]:
dd = pd.concat([df1, df2, df3])
dd

    Name  Age
0  Alice   20
1    Bob   23
0    Ali   20
0  Waqas   30

In [9]:
dd.loc[0]

    Name  Age
0  Alice   20
0    Ali   20
0  Waqas   30

In [11]:
dd = pd.concat([df1, df2, df3], ignore_index=True)
dd

    Name  Age
0  Alice   20
1    Bob   23
2    Ali   20
3  Waqas   30

In [16]:
dd.set_index('Name', inplace=True)

In [18]:
dd.index

Index(['Alice', 'Bob', 'Ali', 'Waqas'], dtype='object', name='Name')

In [19]:
dd.values

array([[20],
       [23],
       [20],
       [30]])

In [22]:
dd.loc['Alice':'Ali']

       Age
Name
Alice   20
Bob     23
Ali     20

In [24]:
dd.reset_index(inplace=True)
dd

    Name  Age
0  Alice   20
1    Bob   23
2    Ali   20
3  Waqas   30

In [ ]:
new_data = pd.DataFrame(
    {
        "Name": ["Wajahat", "Alice", "Bob", "Umar"],
        "Dept": [
            "CS",
            "CS",
            "Phy",
            "Pak",
        ],
        "GPA": [3.4, 3.7, 4.0, 2.3],
    }
)
new_data

      Name Dept  GPA
0  Wajahat   CS  3.4
1    Alice   CS  3.7
2      Bob  Phy  4.0
3     Umar  Pak  2.3

In [27]:
pd.merge(dd, new_data, how="inner", on="Name")

    Name  Age Dept  GPA
0  Alice   20   CS  3.7
1    Bob   23  Phy  4.0

In [94]:
pd.merge(dd, new_data, how="inner", on="Name")

    Name  Age Dept
0  Alice   20   CS
1    Bob   23  Phy

In [28]:
pd.merge(dd, new_data, how="outer", on="Name")

      Name   Age Dept  GPA
0      Ali  20.0  NaN  NaN
1    Alice  20.0   CS  3.7
2      Bob  23.0  Phy  4.0
3     Umar   NaN  Pak  2.3
4  Wajahat   NaN   CS  3.4
5    Waqas  30.0  NaN  NaN

In [29]:
pd.merge(dd, new_data, how="left", on="Name")

    Name  Age Dept  GPA
0  Alice   20   CS  3.7
1    Bob   23  Phy  4.0
2    Ali   20  NaN  NaN
3  Waqas   30  NaN  NaN

In [30]:
pd.merge(dd, new_data, how="right", on="Name")

      Name   Age Dept  GPA
0  Wajahat   NaN   CS  3.4
1    Alice  20.0   CS  3.7
2      Bob  23.0  Phy  4.0
3     Umar   NaN  Pak  2.3

In [100]:
students = pd.merge(dd, new_data, how="outer", on="Name")
students

      Name   Age Dept
0      Ali  20.0  NaN
1    Alice  20.0   CS
2      Bob  23.0  Phy
3     Umar   NaN  Pak
4  Wajahat   NaN   CS

In [104]:
students.isna() # students.isnull()

    Name    Age   Dept
0  False  False   True
1  False  False  False
2  False  False  False
3  False   True  False
4  False   True  False

In [108]:
students.isna().sum()

Name    0
Age     2
Dept    1
dtype: int64

In [109]:
students.count()

Name    5
Age     3
Dept    4
dtype: int64

In [113]:
data.isna().sum()

longitude                     0
latitude                      0
housing_median_age            0
total_rooms                   0
total_bedrooms              207
population                    0
households                    0
median_income                 0
median_house_value            0
ocean_proximity               0
average_number_of_people      0
median_income_k               0
dtype: int64

In [114]:
data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity,average_number_of_people,median_income_k
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,near bay,3.0,8325.2
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,near bay,2.0,8301.4
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,near bay,3.0,7257.4
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,near bay,3.0,5643.1
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,near bay,2.0,3846.2

In [118]:
data.drop("average_number_of_people", axis=1, inplace=True)
data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity,median_income_k
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,near bay,8325.2
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,near bay,8301.4
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,near bay,7257.4
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,near bay,5643.1
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,near bay,3846.2

In [120]:
data.drop(1, inplace=True)
data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity,median_income_k
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,near bay,8325.2
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,near bay,7257.4
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,near bay,5643.1
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,near bay,3846.2
5,-122.25,37.85,52.0,919.0,213.0,413.0,193.0,4.0368,269700.0,near bay,4036.8

In [123]:
data.isna().sum()

longitude               0
latitude                0
housing_median_age      0
total_rooms             0
total_bedrooms        207
population              0
households              0
median_income           0
median_house_value      0
ocean_proximity         0
median_income_k         0
dtype: int64

In [124]:
len(data)

20639

In [128]:
data.dropna().isna().sum()

longitude             0
latitude              0
housing_median_age    0
total_rooms           0
total_bedrooms        0
population            0
households            0
median_income         0
median_house_value    0
ocean_proximity       0
median_income_k       0
dtype: int64

In [129]:
data.isna().sum()

longitude               0
latitude                0
housing_median_age      0
total_rooms             0
total_bedrooms        207
population              0
households              0
median_income           0
median_house_value      0
ocean_proximity         0
median_income_k         0
dtype: int64

In [131]:
students

      Name   Age Dept
0      Ali  20.0  NaN
1    Alice  20.0   CS
2      Bob  23.0  Phy
3     Umar   NaN  Pak
4  Wajahat   NaN   CS

In [132]:
students.isna().sum()

Name    0
Age     2
Dept    1
dtype: int64

In [135]:
ddf = students.ffill()
ddf

      Name   Age Dept
0      Ali  20.0  NaN
1    Alice  20.0   CS
2      Bob  23.0  Phy
3     Umar  23.0  Pak
4  Wajahat  23.0   CS

In [136]:
ddb = students.bfill()
ddb

      Name   Age Dept
0      Ali  20.0   CS
1    Alice  20.0   CS
2      Bob  23.0  Phy
3     Umar   NaN  Pak
4  Wajahat   NaN   CS

In [137]:
students.fillna(0)

      Name   Age Dept
0      Ali  20.0    0
1    Alice  20.0   CS
2      Bob  23.0  Phy
3     Umar   0.0  Pak
4  Wajahat   0.0   CS

In [141]:
mean_age = students["Age"].mean()
mean_age

np.float64(21.0)

In [ ]:
students["Age"] = students["Age"].fillna(mean_age)
students

      Name   Age Dept
0      Ali  20.0  NaN
1    Alice  20.0   CS
2      Bob  23.0  Phy
3     Umar  21.0  Pak
4  Wajahat  21.0   CS

In [150]:
students["Dept"] = students["Dept"].bfill()

In [151]:
students

      Name   Age Dept
0      Ali  20.0   CS
1    Alice  20.0   CS
2      Bob  23.0  Phy
3     Umar  21.0  Pak
4  Wajahat  21.0   CS

## Grouping and Aggregation

- `groupby` with single/multiple keys
- `agg` for multiple aggregations
- `transform` to broadcast group computations back to original shape
- `nunique`, `size`, `count`, and custom lambdas

## Exercises

Apply what you learned. Try first; then run the solutions below.

1) Create a DataFrame of products with columns: `product`, `category`, `price`, `discount_pct`. Add:
   - `price_after_discount`
   - `category_full` via mapping dict
   - `price_bucket` using `np.select` (e.g., <20 cheap, 20-50 mid, >50 premium)
2) Reshape: Given wide monthly sales columns `Jan`, `Feb`, `Mar`, transform to long with `melt`, then pivot back.
3) Combine: Merge a `customers` table with `orders` table on `customer_id` (left join). Validate relationship as many-to-one.
4) GroupBy: For `orders` with `customer_id`, `amount`, compute total amount per customer, the mean amount, and the share of each order within the customer total using `transform`.